
## Terraform plan for environment: `dev`

**Commit:** cc5fd8e014c44cdd897976aa004aa54877c111de


**API version:** d15d632250
**CLI version:** d15d632250
**Selfserve version:** d15d632250
**Internal version:** e7db7ebe26
**search version:** d68f999c67

### Plan summary

`4 to add, 88 to change, 1 to destroy`

**🆕 Creates**

```tf
module.service.module.ecs_service["api"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["search"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_task_definition.this[0]
```
**🗑️ Deletes**

```tf
null_resource.deployed_versions
```
**📖 Reads**

```tf
module.service.module.ecs_service["api"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["search"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].data.aws_ecs_task_definition.this[0]
module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0]
```
**🔄 Updates**

```tf
module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"]
module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"]
module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"]
module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"]
module.service.module.batch.aws_batch_job_definition.this["cns"]
module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"]
module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"]
module.service.module.batch.aws_batch_job_definition.this["database-maintenance"]
module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"]
module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"]
module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"]
module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"]
module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"]
module.service.module.batch.aws_batch_job_definition.this["import-anondb"]
module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"]
module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"]
module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"]
module.service.module.batch.aws_batch_job_definition.this["international-goods-export"]
module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"]
module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"]
module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"]
module.service.module.batch.aws_batch_job_definition.this["ni-compliance"]
module.service.module.batch.aws_batch_job_definition.this["populate-anondb"]
module.service.module.batch.aws_batch_job_definition.this["process-cl"]
module.service.module.batch.aws_batch_job_definition.this["process-company-profile"]
module.service.module.batch.aws_batch_job_definition.this["process-inbox"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"]
module.service.module.batch.aws_batch_job_definition.this["process-ntu"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-community-licences"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-ecmt-accept"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-general"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-irhp-allocate"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-print"]
module.service.module.batch.aws_batch_job_definition.this["psv-operator-list-export"]
module.service.module.batch.aws_batch_job_definition.this["remove-read-audit"]
module.service.module.batch.aws_batch_job_definition.this["resolve-payments"]
module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"]
module.service.module.batch.aws_batch_job_definition.this["system-parameter"]
module.service.module.batch.aws_batch_job_definition.this["transxchange-consumer"]
module.service.module.cloudfront.aws_cloudfront_distribution.this[0]
module.service.module.ecs_service["api"].aws_ecs_service.this[0]
module.service.module.ecs_service["internal"].aws_ecs_service.this[0]
module.service.module.ecs_service["search"].aws_ecs_service.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0]
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-clean-up-variations"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-close-expired-windows"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-cns"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-company-profile-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-create-psv-licence-surrender-task"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-digital-continuation-reminders"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-duplicate-vehicle-warning"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-enqueue-ch-compare"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-expire-bus-registration"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-flag-urgent-tasks"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-inspection-request-email"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-interim-end-date-enforcement"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-international-goods-export"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-last-tm-letter"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-licence-status-rules"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-mark-expired-permits"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-company-profile"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-inbox"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-insolvency"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-insolvency-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-ntu"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-community-licences"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-disc-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-disc-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-ecmt-accept"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-general"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-irhp-allocate"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-permit-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-permit-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-process-queue-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-psv-operator-list-export"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-remove-read-audit"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-resolve-payments"]
module.service.module.eventbridge.aws_scheduler_schedule.this["dev-transxchange-consumer"]
```


----

<details data-gh-workflow="dev-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # null_resource.deployed_versions must be replaced
-/+ resource "null_resource" "deployed_versions" {
      ~ id       = "6613920196415822250" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "deployed_api_image_tag"       = "release-v5.24.24-rc24" -> "d15d632250"
          ~ "deployed_assets_version"      = "release-v5.24.24-rc24" -> "release-v5.17.0"
          ~ "deployed_cli_image_tag"       = "release-v5.24.24-rc24" -> "d15d632250"
          ~ "deployed_internal_image_tag"  = "release-v5.24.24-rc24" -> "e7db7ebe26"
          ~ "deployed_selfserve_image_tag" = "release-v5.24.24-rc24" -> "d15d632250"
        }
    }

  # module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cancel-unsubmitted-bilateral:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cancel-unsubmitted-bilateral:202"
        name                       = "vol-app-dev-cancel-unsubmitted-bilateral"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ch-vs-olcs-diffs:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ch-vs-olcs-diffs:202"
        name                       = "vol-app-dev-ch-vs-olcs-diffs"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-clean-up-variations:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-clean-up-variations:202"
        name                       = "vol-app-dev-clean-up-variations"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-close-expired-windows:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-close-expired-windows:202"
        name                       = "vol-app-dev-close-expired-windows"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["cns"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cns:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cns:202"
        name                       = "vol-app-dev-cns"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-company-profile-dlq:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-company-profile-dlq:202"
        name                       = "vol-app-dev-company-profile-dlq"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-create-psv-licence-surrender-task:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-create-psv-licence-surrender-task:202"
        name                       = "vol-app-dev-create-psv-licence-surrender-task"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-delete:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-delete:202"
        name                       = "vol-app-dev-data-retention-delete"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-populate:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-populate:202"
        name                       = "vol-app-dev-data-retention-populate"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-postcheck:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-postcheck:202"
        name                       = "vol-app-dev-data-retention-postcheck"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-precheck:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-precheck:202"
        name                       = "vol-app-dev-data-retention-precheck"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["database-maintenance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-database-maintenance:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-database-maintenance:202"
        name                       = "vol-app-dev-database-maintenance"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-digital-continuation-reminders:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-digital-continuation-reminders:202"
        name                       = "vol-app-dev-digital-continuation-reminders"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-duplicate-vehicle-warning:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-duplicate-vehicle-warning:202"
        name                       = "vol-app-dev-duplicate-vehicle-warning"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-enqueue-ch-compare:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-enqueue-ch-compare:202"
        name                       = "vol-app-dev-enqueue-ch-compare"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-expire-bus-registration:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-expire-bus-registration:202"
        name                       = "vol-app-dev-expire-bus-registration"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-flag-urgent-tasks:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-flag-urgent-tasks:202"
        name                       = "vol-app-dev-flag-urgent-tasks"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-anondb:96" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v5.24.24-rc24"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dev-dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "DEV"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "dev.olcs.dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.dev.olcs.dev-dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "d15d632250"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-anondb:96"
        name                       = "vol-app-dev-import-anondb"
      ~ revision                   = 96 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-users-from-csv:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-users-from-csv:202"
        name                       = "vol-app-dev-import-users-from-csv"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-inspection-request-email:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-inspection-request-email:202"
        name                       = "vol-app-dev-inspection-request-email"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-interim-end-date-enforcement:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-interim-end-date-enforcement:202"
        name                       = "vol-app-dev-interim-end-date-enforcement"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["international-goods-export"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-international-goods-export:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-international-goods-export:202"
        name                       = "vol-app-dev-international-goods-export"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-last-tm-letter:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-last-tm-letter:202"
        name                       = "vol-app-dev-last-tm-letter"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-licence-status-rules:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-licence-status-rules:202"
        name                       = "vol-app-dev-licence-status-rules"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-mark-expired-permits:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-mark-expired-permits:202"
        name                       = "vol-app-dev-mark-expired-permits"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ni-compliance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ni-compliance:96" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v5.24.24-rc24"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dev-dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "DEV"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "dev.olcs.dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.dev.olcs.dev-dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "d15d632250"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ni-compliance:96"
        name                       = "vol-app-dev-ni-compliance"
      ~ revision                   = 96 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["populate-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-populate-anondb:96" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v5.24.24-rc24"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dev-dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "DEV"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "dev.olcs.dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.dev.olcs.dev-dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "d15d632250"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-populate-anondb:96"
        name                       = "vol-app-dev-populate-anondb"
      ~ revision                   = 96 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-cl"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-cl:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-cl:202"
        name                       = "vol-app-dev-process-cl"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-company-profile"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-company-profile:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-company-profile:202"
        name                       = "vol-app-dev-process-company-profile"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-inbox"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-inbox:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-inbox:202"
        name                       = "vol-app-dev-process-inbox"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-insolvency"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency:202"
        name                       = "vol-app-dev-process-insolvency"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency-dlq:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency-dlq:202"
        name                       = "vol-app-dev-process-insolvency-dlq"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-ntu"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-ntu:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-ntu:202"
        name                       = "vol-app-dev-process-ntu"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-community-licences"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-community-licences:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-community-licences:202"
        name                       = "vol-app-dev-process-queue-community-licences"
      ~ revision                   = 202 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-generation"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-generation:202" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v5.24.24-rc24" -> "DEV"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "DEV" -> "d15d632250"
                    },
                ]
              ~ image                        = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v5.24.24-rc24" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:d15d632250"
              ~ logConfiguration             = {
                  - secretOpt... (truncated, see full plan in the workflow run logs)
```

</details>